eisup_2019_docmng_integration/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильПолномочийПользователя</name>
    <type>
      <types>CatalogRef.ПрофилиПолномочийПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИмяВДомене</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОтправлятьУведомления</name>
    <type>
      <types>EnumRef.абс_РежимОтправкиУведомлений</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОтправлятьУведомленияКакИнициатору</name>
    <type>
      <types>EnumRef.абс_РежимОтправкиУведомлений</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_РасширенноеПравоПроведенияДокументов</name>
    <comment>(без контроля номенклатуры и контрагентов)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НеСниматьРегламентно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТелефонныйКодГруппы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Компьютер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЭтоПользовательАбсолютСофт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НеАктивныйПользователь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПользовательОС_СтароеЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <comment>(Общ)</comment>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.НастройкиПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.НастройкиПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/ЗначенияДополнительныхПравПользователя/ЗначенияДополнительныхПравПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияДополнительныхПравПользователя</name>
  <comment>(Общ)</comment>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.ПраваПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ПрофилиПолномочийПользователей</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Право</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПраваПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/РолиИИсполнители/РолиИИсполнители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РолиИИсполнители</name>
  <resources>
    <name>абс_ИндексИсполнителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/НастройкиПравДоступаПользователей/НастройкиПравДоступаПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПравДоступаПользователей</name>
  <resources>
    <name>Чтение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Запись</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ВидНаследованияПравДоступаИерархическихСправочников</name>
    <type>
      <types>EnumRef.ВидыНаследованияПравДоступаИерархическихСправочников</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаКонтрагентов</types>
      <types>CatalogRef.ТипыЗаписейЗаметок</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.ВнешниеОбработки</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ГруппыЗаявокКандидатов</types>
      <types>CatalogRef.НазначенияИспользованияСпецификаций</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбъектаДоступа</name>
    <type>
      <types>EnumRef.ВидыОбъектовДоступа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбластьДанных</name>
    <type>
      <types>EnumRef.ОбластиДанныхОбъектовДоступа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВладелецПравДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаКонтрагентов</types>
      <types>CatalogRef.ТипыЗаписейЗаметок</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.ВнешниеОбработки</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ГруппыЗаявокКандидатов</types>
      <types>CatalogRef.НазначенияИспользованияСпецификаций</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаследованаОтВсеПользователи</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/ВидыОбъектовДоступа/ВидыОбъектовДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОбъектовДоступа</name>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>Организации</name>
  </enumValues>
  <enumValues>
    <name>ФизическиеЛица</name>
  </enumValues>
  <enumValues>
    <name>Проекты</name>
  </enumValues>
  <enumValues>
    <name>Склады</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкиКандидатов</name>
  </enumValues>
  <enumValues>
    <name>ВнешниеОбработки</name>
  </enumValues>
  <enumValues>
    <name>Заметки</name>
  </enumValues>
  <enumValues>
    <name>Подразделения</name>
  </enumValues>
  <enumValues>
    <name>ПодразделенияОрганизаций</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
    <comment>Дополнительный вид объекта доступа</comment>
  </enumValues>
  <enumValues>
    <name>Спецификации</name>
  </enumValues>
  <enumValues>
    <name>ЦеныНоменклатуры</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ВидыНаследованияПравДоступаИерархическихСправочников/ВидыНаследованияПравДоступаИерархическихСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНаследованияПравДоступаИерархическихСправочников</name>
  <enumValues>
    <name>НаследуетсяОтРодителя</name>
  </enumValues>
  <enumValues>
    <name>РаспространитьНаПодчиненных</name>
  </enumValues>
  <enumValues>
    <name>ТолькоДляТекущегоПрава</name>
  </enumValues>
  <enumValues>
    <name>УнаследованоОтДочернего</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/ГруппыПользователей/ГруппыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПользователей</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВсеПользователи</name>
      <description>Все пользователи</description>
    </items>
  </predefined>
  <attributes>
    <name>абс_ЭтоДЗО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользователиГруппы</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_Редактируют</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/Пользователи/Forms/ФормаСписка/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ ФОРМЫ
//

&НаКлиенте
Процедура КонтактнаяИнформация(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено 
		ИЛИ ТекущиеДанные.ЭтоГруппа Тогда
		
		Предупреждение("Необходимо выбрать пользователя"); 
		Возврат;
	КонецЕсли; 
	
	ФормаРедактрованияКИ = ПолучитьФорму("Справочник.Пользователи.Форма.РедактированиеКонтактнойИнформации");
	ФормаРедактрованияКИ.Ссылка = ТекущиеДанные.Ссылка;
	ФормаРедактрованияКИ.ОткрытьМодально();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПользователя(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено 
		ИЛИ ТекущиеДанные.ЭтоГруппа Тогда
		
		Предупреждение("Необходимо выбрать пользователя"); 
		Возврат;
	КонецЕсли; 
	
	ФормаНастройкиГруппПользователя = ПолучитьФорму("Справочник.Пользователи.Форма.ФормаНастройкиГруппПользователя");
	ФормаНастройкиГруппПользователя.Пользователь = ТекущиеДанные.Ссылка;
	ФормаНастройкиГруппПользователя.ОткрытьМодально();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПользователя(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено 
		ИЛИ ТекущиеДанные.ЭтоГруппа Тогда
		
		Предупреждение("Необходимо выбрать пользователя"); 
		Возврат;
	КонецЕсли; 
	
	ФормаРедактрованияНастроек = ПолучитьФорму("РегистрСведений.НастройкиПользователей.Форма.ФормаРедактированияНастроек");
	ФормаРедактрованияНастроек.НачальноеЗначениеВыбора = ТекущиеДанные.Ссылка;
	ФормаРедактрованияНастроек.ОткрытьМодально();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПрава(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено 
		ИЛИ ТекущиеДанные.ЭтоГруппа Тогда
		
		Предупреждение("Необходимо выбрать пользователя"); 
		Возврат;
	КонецЕсли; 
	
	Если ТекущиеДанные.ПрофильПолномочийПользователя.Пустая() Тогда
		ФормаРедактирования = ПолучитьФорму("РегистрСведений.ЗначенияДополнительныхПравПользователя.Форма.ФормаРедактирования");
		ФормаРедактирования.Пользователь = ТекущиеДанные.Ссылка;
		ФормаРедактирования.Открыть();		
	Иначе
		Предупреждение("Пользователю назначен профиль.
					|Настройка дополнительных прав выполняется в форме профиля.",, "Дополнительные права");
	КонецЕсли; 
	
КонецПроцедуры
 

////////////////////////////////////////////////////////////////////////////////
// ФОРМА
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	//АБС_Родин
	МассивРазрешенныхПользователей = ПолучитьМассивРазрешенныхПользователей();	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение = МассивРазрешенныхПользователей;
	//АБС_Родин	
	
	//АБС ИЗМЕНЕНО №36432 НАЧАЛО
	//90% тормозов при открытии списка из-за этой проверки, убрал проверку
	//УправлениеПользователямиСервер.ПроверитьСинхронизациюПользователейИУстановитьОформлениеСписка(Список.УсловноеОформление);
	//\\АБС ИЗМЕНЕНО №36432 КОНЕЦ
	
	Если ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.ОбычноеПриложение Тогда
		// Доп. сведения доступны только в обычном приложении
		Элементы.ДополнительныеСведения.Видимость = Истина;
		
		мНаличиеПраваАдминистрирования = УправлениеДопПравамиПользователей.ЕстьПравоАдминистрированияПользователей();
		Если НЕ мНаличиеПраваАдминистрирования Тогда 
			Элементы.Администрирование.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененПользовательИБ" Тогда
		ОбщегоНазначенияКлиентСервер.СнятьУсловноеОформлениеСпискаЗначений(Список.УсловноеОформление, "ЭлементыСправочникаТребующиеВнимания", Параметр);
	КонецЕсли;
	
КонецПроцедуры

//Абс_Родин
&НаСервере
Функция ПолучитьМассивРазрешенныхПользователей()
	 
	 МассивРазрешенныхПользователей = Новый Массив;
	 ЕстьРольСогласования =  Ложь;
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	РолиИИсполнители.Исполнитель
	 |ИЗ
	 |	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
	 |ГДЕ
	 |	РолиИИсполнители.Роль В(&Роль)
	 |	И РолиИИсполнители.Исполнитель = &Исполнитель";
	 
	 МассивРолей = Новый Массив;
	 МассивРолей.Добавить(Справочники.РолиИсполнителей.СуперПользователь);
	 МассивРолей.Добавить(Справочники.РолиИсполнителей.СотрудникИнициаторКомпании);
	 МассивРолей.Добавить(Справочники.РолиИсполнителей.СогласованиеНастройкиПравНаУровнеДЗО);
	 МассивРолей.Добавить(Справочники.РолиИсполнителей.СогласованиеНастройкиПравНаУровнеКТТК);
	 
	 Запрос.УстановитьПараметр("Исполнитель", ПараметрыСеанса.ТекущийПользователь);
	 Запрос.УстановитьПараметр("Роль", МассивРолей);
	 Результат = Запрос.Выполнить();
	 ВыборкаДетальныеЗаписи = Результат.Выбрать();
	 Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		 ЕстьРольСогласования =  Истина;	
	 КонецЕсли;
	 
	 Если ЕстьРольСогласования Тогда 
		 Запрос = Новый Запрос;
		 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	Пользователи.Ссылка КАК Пользователь
		 |ПОМЕСТИТЬ ДоступКоВсем
		 |ИЗ
		 |	РегистрСведений.НастройкиПравДоступаПользователей КАК НастройкаДоступа
		 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		 |		ПО (ИСТИНА)
		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.ПользователиГруппы КАК ГруппыПользователейПользователиГруппы
		 |		ПО НастройкаДоступа.Пользователь = ГруппыПользователейПользователиГруппы.Ссылка
		 |ГДЕ
		 |	НастройкаДоступа.ВидОбъектаДоступа В(&МассивВидовОбъектов)
		 |	И НастройкаДоступа.ВидНаследованияПравДоступаИерархическихСправочников = &НаПодчиненных
		 |	И НастройкаДоступа.ОбъектДоступа В(&СписокПустыхСсылок)
		 |	И ГруппыПользователейПользователиГруппы.Пользователь = &Пользователь
		 |
		 |ИНДЕКСИРОВАТЬ ПО
		 |	Пользователь
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	ГруппыПользователейПользователиГруппы.Ссылка КАК Пользователь
		 |ПОМЕСТИТЬ ВсеГруппыПользователя
		 |ИЗ
		 |	Справочник.ГруппыПользователей.ПользователиГруппы КАК ГруппыПользователейПользователиГруппы
		 |ГДЕ
		 |	ГруппыПользователейПользователиГруппы.Пользователь = &Пользователь
		 |
		 |ИНДЕКСИРОВАТЬ ПО
		 |	Пользователь
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	ГруппыПользователейПользователиГруппы.Пользователь
		 |ИЗ
		 |	Справочник.ГруппыПользователей.ПользователиГруппы КАК ГруппыПользователейПользователиГруппы,
		 |	ВсеГруппыПользователя КАК ВсеГруппыПользователя
		 |ГДЕ
		 |	ГруппыПользователейПользователиГруппы.Ссылка В
		 |			(ВЫБРАТЬ
		 |				ВсеГруппыПользователя.Пользователь
		 |			ИЗ
		 |				ВсеГруппыПользователя КАК ВсеГруппыПользователя)
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	ГруппыПользователейПользователиГруппы.Пользователь
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	ДоступКоВсем.Пользователь
		 |ИЗ
		 |	ДоступКоВсем КАК ДоступКоВсем";
		 
		 мМассивПустыхЗначенийОбъектаДоступа = ОбщегоНазначения.МассивПустыхЗначений(Метаданные.РегистрыСведений.НастройкиПравДоступаПользователей.Измерения.ОбъектДоступа.Тип);

		 МассивВидовОбъектов = Новый Массив;
		 МассивВидовОбъектов.Добавить(Перечисления.ВидыОбъектовДоступа.Организации);
		 
		 Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
		 Запрос.УстановитьПараметр("МассивВидовОбъектов", МассивВидовОбъектов);
		 Запрос.УстановитьПараметр("СписокПустыхСсылок", мМассивПустыхЗначенийОбъектаДоступа);
		 Запрос.УстановитьПараметр("НаПодчиненных", Перечисления.ВидыНаследованияПравДоступаИерархическихСправочников.РаспространитьНаПодчиненных);
		 
		 
		 Выборка = Запрос.Выполнить().Выбрать();
		 Пока Выборка.Следующий() Цикл
			 МассивРазрешенныхПользователей.Добавить(Выборка.Пользователь);	
		 КонецЦикла;	
		 
	 КонецЕсли;
	 
     Возврат МассивРазрешенныхПользователей;
	 
 КонецФункции  
//АБС_Родин

&НаКлиенте
Процедура ИсторияИзмененияПрав(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено 
		ИЛИ ТекущиеДанные.ЭтоГруппа Тогда
		
		Предупреждение("Необходимо выбрать пользователя"); 
		Возврат;
	КонецЕсли; 
	
	ФормаНастройкиПрав = ПолучитьФорму("Документ.абс_ЗаявкаНаДобавлениеИзменениеПрав.Форма.ФормаСписка");
	ЭлементОтбора = ФормаНастройкиПрав.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пользователь");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение = Элементы.Список.ТекущиеДанные.Ссылка;

	ФормаНастройкиПрав.Открыть();

КонецПроцедуры
